{
  "title": "Programming",
  "pages": [
    {
      "content": [
        {
          "type": "title",
          "text": "Programming projects"
        },
        {
          "type": "text",
          "text": "This page exists for collecting the projects that I've worked on, and that I actually feel are good enough to deserve mention. I've programmed for a very long time, and there are probably hundreds of things that I've started (how many I've *finished*, on the other hand, is probably more easily counted). But most of those were a mess - nothing I'd want to add in a public repo.\n\nHonestly, the projects here are also really quite messy, but at least I can understand the code I've written."
        },
        {
          "type": "text",
          "text": "For now, the only project here is my [Secret Santa](?page=programming/secret_santa) app. More to come later."
        }
      ]
    },
    {
      "content": [
        {
          "type": "title",
          "text": "Programming over time"
        },
        {
          "type": "text",
          "text": "For fun, and to keep track myself, I'll write out what programming languages I've preferred working in over time here. Note that this was written 2025 (early university), so anything before that is from my memory only."
        },
        {
          "type": "text",
          "text": "**2014-2016 (8y-10y): Scratch**. (Yes, I do count scratch as a programming language). I was introduced to Scratch programming (and a number of other, similar, systems) in school. I tended to sit for way too long and make elaborate platformers and copies of other simple games (I remember a Polka dot game that I was quite proud of). It was a fun time, but looking back, I actually already felt like I wanted some basic OOP - not in those terms, of course, but I wanted variables-per-object, and a way to inherit behaviour."
        },
        {
          "type": "text",
          "text": "**2016-2017 (10y-11y): Scratch, Python**. Around this point, I get a book detailing HTML/CSS/JS, but it's all way over my head so I don't touch it much. Python, on the other hand, is way easier for me to understand. At this point I'm into programming enough that the lack of visuals (I didn't do anything with Pygame) isn't a big issue, I'm exited either way. I'm still going back to scratch every now and then to make something small, though mostly ironically/for fun."
        },
        {
          "type": "text",
          "text": "**2017-2021 (11y-15y): Processing, Unity/C#, Python**. Somewhere around here is when I start learning Unity. I understand C#:s strong typing relatively quickly. I start making bad Discord bots in Python, which I find fun - it's the first time I actually use code *for* something. I also discover and learn Processing, which I see at the time as a bit like Python, but typed and with easy graphics. I start preferring that over Python as my \"mock-up\"-language."
        },
        {
          "type": "text",
          "text": "**2021-2025 (15y-18y): Unity/C#, HTML/CSS/JS, Processing**. In 2021, I take a programming course in high school, which was in Javascript. I quickly grow to prefer it over Python, since the syntax makes more sense to me and I like the divide between layout (HTML), design (CSS) and behaviour (JS). I still use Processing every now and then, but JS becomes my go-to. This is also where I really start getting into [Desmos](?page=desmos), and most of those projects are from late high school."
        },
        {
          "type": "text",
          "text": "**2025- (18y-): Pure C#, Unity/C#, HTML/CSS/JS, Python**. My programming courses in university use C#, and I really like it. I already knew most of the syntax from my earlier Unity experiments, but using it without all the Unity things felt really nice - it was like being back with Python, except this time I had a typed language with OOP capabilities. It's one of the only environments where I haven't felt like I had to fight the code to get what I wanted. I still occasionally use JS for mockups (though I have started disliking it a bit), and I'm using Python to program a Raspberry Pi to do my bidding. I also put off learning Git until now, but this is where I start understanding how it works."
        },
        {
          "type": "text",
          "text": "As of 2025, I'm considering switching to Java over C#. I'm somewhat familiar with Java syntax from Processing, but the lack of features like computed properties and other \"QOL\" things kind of put me off. My Java projects have felt more like fighting the code again, especially compared to C#. But Java being so cross-platform is nice. I've also briefly pondered Rust, but that seems like an amalgamation of paradigms that doesn't know what it wants, and I need my inheritance."
        }
      ]
    }
  ]
}
