{
  "title": "Desmos",
  "pages": [
    {
      "content": [
        {
          "type": "title",
          "text": "My Desmos projects"
        },
        {
          "type": "text",
          "text": "I love Desmos. It's good-looking, intutitve and powerful. There's a surprisingly large community of math nerds out there, who can do amazing things. I'm not as good as them, unfortunately, but I can generally get the graph paper to do what I want.\n\nMy favourite graphs are probably [my Tetris copies](?page=tetris), particularly version 2, and [my 3D renderers](?page=3desmos) (again, particularly version 2). Otherwise, most of my graphs are visualizations of specific maths or physics concepts, or in some cases mockups of algorithms that I want to use in other programs.\n\nI'm also a big fan of Desmodder - a browser extension that adds a lot of QOL functionality to graphs. I cannot recommend it enough.\n\nHere are some of my graphs:\n- [Tetris](?page=tetris): After learning about actions, I made a bad tetris game. Later on, I made a slightly better Tetris game. Here they are.\n- [3D renderers](?page=3desmos): Version one was my very first \"big\" Desmos project, and I enjoyed it a lot. Later on, it turned out I knew nothing about projective geometry, so after learning some more about it (as well as a few Desmos tricks) I decided to make a new version.\n\n- [Harmonograph](?page=harmonograph): I've been fascinated by harmonographs for a long time, but never was able to build a physical one. So eventually, I made one in Desmos instead. This is one of my most extensively commented graphs, so it should be easy-ish to handle.\n\n- [Budget sigmoids](?page=sigmoid_collection): I've collected what I call \"budget sigmoids\" for a while. This is a collection of functions that interpolate smoothly between 0 and 1, none of which can be transformed into each other.\n\nOf course, I have many more graphs on my account. But these are my favourites."
        }
      ]
    }
  ]
}
